function read() {
  return[
    ['-','8','6','-','1','9','4','2','7'],
    ['-','2','-','7','-','-','9','-','-'],
    ['-','7','-','-','5','-','-','8','3'],
    ['7','-','-','-','6','-','5','9','8'],
    ['-','-','8','9','-','-','-','-','-'],
    ['-','9','1','-','-','5','7','-','-'],
    ['-','6','-','5','-','3','8','7','1'],
    ['-','-','-','-','-','-','3','-','9'],
    ['4','3','7','1','-','8','-','5','-'],
  ]
}

function solve() {
  /**
   * Принимает игровое поле в том формате, в котором его вернули из функции read.
   * Возвращает игровое поле после попытки его решить.
   */
}

function isSolved() {
  /**
   * Принимает игровое поле в том формате, в котором его вернули из функции solve.
   * Возвращает булевое значение — решено это игровое поле или нет.
   */
}

function prettyBoard() {
  /**
   * Принимает игровое поле в том формате, в котором его вернули из функции solve.
   * Выводит в консоль/терминал судоку.
   * Подумай, как симпатичнее его вывести.
   */
}
